app/Controllers/Kasus.php

    public function index()
    {
        $modelKasus = new Modelkasus();
        $data = $modelKasus->findAll();
---
SELECT *
FROM `kasus`

    public function show($cari = null)
    {
        $modelKasus = new Modelkasus();

        $data = $modelKasus->orLike('kasus', $cari)
            ->orLike('kronologi', $cari)->get()->getResult();
---
SELECT *
FROM `kasus`
WHERE `kasus` LIKE '%pelaku%' ESCAPE '!'
OR  `kronologi` LIKE '%pelaku%' ESCAPE '!'