app/Controllers/Mahasiswa.php

SELECT *
FROM `mahasiswa`
---
    public function index()
    {
        $modelMhs = new Modelmahasiswa();
        $data = $modelMhs->findAll();